package examples;

public class ex64 {

	public static void main(String[] args) {

		// 함수 function - 자바: 메소드 method
		// 일종의 코드 블럭(뭉치)
		// 만드는 이유
		// 1. 코드의 중복을 피하기 위해
		// 2. 코드의 구조를 단순하게 (반복문이나 조건문에서 depth를 줄일수있다)
		// 3. 입력(매개변수)과 출력(반환값)을 명확하게 하고,
		// 4. 코드 뭉치에 이름을 붙일 수 있다.

		// JS
		// function 함수이름(매개변수) {
		// 수행문
		// return 반환값;
		// }
		// 함수이름( 변수 );
		// 패턴
		// 함수의 선언
		// 반환형 함수이름( 매개변수타입 매개변수이름 ) {
		// 수행문
		// return 반환값;
		// }
		// 함수의 호출
		// 함수이름(매개변수);
	}
}